In [2]:
import tensorflow as tf
import pandas as pd

파일경로 = 'C:\sample_py/friend.csv'
데이터 = pd.read_csv(파일경로)
데이터.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [4]:

파일경로 = 'C:\sample_py/melon.csv'
데이터 = pd.read_csv(파일경로)
데이터.head()

   rank              singer                            title
0     1           IVE (아이브)                             I AM
1     2           IVE (아이브)                           Kitsch
2     3  LE SSERAFIM (르세라핌)  UNFORGIVEN (feat. Nile Rodgers)
3     4     세븐틴 (SEVENTEEN)                              손오공
4     5          지수 (JISOO)                                꽃

In [7]:
temp = 데이터.copy()

In [8]:
temp['rank'] = 20
temp

,rank,singer,title
0,20,IVE (아이브),I AM
1,20,IVE (아이브),Kitsch
2,20,LE SSERAFIM (르세라핌),UNFORGIVEN (feat. Nile Rodgers)
3,20,세븐틴 (SEVENTEEN),손오공
4,20,지수 (JISOO),꽃
...,...,...,...
95,20,태양,나의 마음에 (Seed)
96,20,김호중,그중에 그대를 만나
97,20,정국,Dreamers [Music from the FIFA World Cup Qatar ...
98,20,Say Yes!,Say My Name
99,20,Aimyon,愛を伝えたいだとか / Ai Wo Tsutaetaidatoka (사랑을 전하고 싶다든가)

In [10]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [11]:
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [12]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [1]:
a = "Pithon"
a[1]

'i'

In [2]:
a[1] = 'y'
a

TypeError: 'str' object does not support item assignment

In [3]:
"I eat %d apples." % 3

'I eat 3 apples.'

In [1]:
# 메모리 사이즈 테스트
import sys

test_list = list(range(100))
test_tuple = tuple(range(100))

print(sys.getsizeof(test_list))    # 904(bytes for the list object)
print(sys.getsizeof(test_tuple))   # 840(bytes for the tuple object)

856
840

In [3]:
import time
test_list = list(range(100000))
test_tuple = tuple(range(100000))

list_start = time.time()
for l in test_list:
    data = test_list[20000]
list_time = time.time() - list_start

tuple_start = time.time()
for l in test_tuple:
    data = test_tuple[20000]
tuple_time = time.time() - tuple_start

print(list_time)  # time: 0.011872053146362305
print(tuple_time) # time: 0.009997844696044922

0.024005651473999023
0.022543907165527344